# Итоговая проверочная работа

## Задача :

**Написать программу, которая из имеющегося массива строк формирует массив из строк, длина которых меньше или равна 3 символам.**

### 1. Написал изначальный массив, с заданным количество элементов:
*  __string[] array1 = new string[7] {"541642", "11", "Привет","Дуб", "090", "51", "63212"};__
* __string[] array2 = new string[array1.Length];__
### 2. Решение задачи:

1. Делаем перебор значений из имеющегося массива.
2. Проверяем каждое значение на соответствие условию : **длина строки меньше или равна 3**.
3. Если значение удовлетворяет условию, кладем его в новый массив.
4. Повторяем это действие, пока не достигнем конца массива.



       void ArrayReduction(string[] array1, string[] array2)
       {
        int count = 0;
        for (int i = 0; i < array1.Length; i++)
        {
            if(array1[i].Length <= 3)
            {
                array2[count] = array1[i];
                count++;
            }
        }
        }

5. Выводим новый масив как результат :

       void PrintArray(string[] array)
       {
        for (int i = 0; i < array.Length; i++)
        {
            Console.Write($"{array[i]} ");
        }
        Console.WriteLine();
       }

### 3. ОбЪявил написанные функции:

* ArrayReduction(array1, array2);

* PrintArray(array2);

